# ==================================================
# YOLO11-compatible HGNet-style backbone (SAFE)
# ==================================================

nc: 15
depth_multiple: 0.67
width_multiple: 0.75

# ---------------- BACKBONE ----------------
backbone:
  - [-1, 1, Conv, [64, 3, 2]]     # 0
  - [-1, 1, Conv, [128, 3, 2]]    # 1
  - [-1, 3, C2f, [128]]           # 2

  - [-1, 1, Conv, [256, 3, 2]]    # 3 (P3)
  - [-1, 6, C2f, [256]]           # 4

  - [-1, 1, Conv, [512, 3, 2]]    # 5 (P4)
  - [-1, 6, C2f, [512]]           # 6

  - [-1, 1, Conv, [1024, 3, 2]]   # 7 (P5)
  - [-1, 3, C2f, [1024]]          # 8
  - [-1, 1, SPPF, [1024, 5]]      # 9

# ---------------- HEAD ----------------
head:
  - [[4, 6, 9], 1, Detect, [nc]]
